Catalogs/Лиды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Лиды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭПДляПоиска</Name>
					<Comment>Адрес ЭП для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантЗавершенияРаботыСЛидом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаметкиЗавершенияРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактыПеренесены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКомпании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаДляПоиска</Name>
					<Comment>Номер телефона для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНеуспешногоЗавершенияРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныНеуспешногоЗавершенияРаботыСЛидом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЛида</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКонтакты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СвязиКонтрагентЛид.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентЛид</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лиды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СвязиКонтрагентКонтакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентКонтакт</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязьНедействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Лиды/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.Свойство("ПереводВКачественныйЛид") Тогда
			ЗаполнитьЕслиЛидПереводитсяВКачественный();
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("ПереводВНекачественныйЛид") Тогда
			ЗаполнитьЕслиЛидПереводитсяВНекачественный();
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("ВозвратВРаботу") Тогда
			ЗаполнитьВозвратЛидаВРаботу(ДанныеЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеПередЗаписью(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЗаполнитьНомерТелефона();
	ЗаполнитьАдресЭП();
	
	СостоянияЛидов.ПередЗаписьюЛида(ЭтотОбъект);
	
	ОбработатьКонтрагентаИВидПередЗаписью();
	
	СформироватьОсновныеСведенияЛида();
	
	СтарыеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СостояниеЛида,ВариантЗавершения");
	ДополнительныеСвойства.Вставить("ЭтоНовыйЛид", ЭтоНовый());
	ДополнительныеСвойства.Вставить("СостояниеЛидаПередЗаписью", СтарыеЗначенияРеквизитов.СостояниеЛида);
	ДополнительныеСвойства.Вставить("ВариантЗавершенияПередЗаписью", СтарыеЗначенияРеквизитов.ВариантЗавершения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СостоянияЛидов.ПриЗаписиЛида(ЭтотОбъект);
	ДобавитьЗаписиВКанбанПриЗаписи();
	ОбработатьКонтрагентаПриЗаписи();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеДоКопирования = СостояниеЛида;
	СостояниеЛида = ЗаполнениеОбъектовУНФ.ПолучитьСостояниеЛида();
	
	Если НЕ СостояниеДоКопирования = Справочники.СостоянияЛидов.Завершен Тогда
		Возврат;
	КонецЕсли;
	
	ПричинаНеуспешногоЗавершенияРаботы = Неопределено;
	ВариантЗавершения = Неопределено;
	ДатаЗавершенияРаботы = Дата('00010101');
	ЗаметкиЗавершенияРаботы = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не Справочники.ГруппыДоступаЛидов.ИспользуютсяГруппыДоступа() Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ГруппаДоступа");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВариантЗавершения) 
		ИЛИ ВариантЗавершения = Перечисления.ВариантЗавершенияРаботыСЛидом.ПереведенВПокупателя Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПричинаНеуспешногоЗавершенияРаботы");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ТекущиеВходящиеЗвонки.ПередУдалениемКонтакта(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Заполнение

Процедура ПроверитьЗаполнениеПередЗаписью(Отказ)
	
	ПроверитьЗаполнениеВидаИКонтрагента(Отказ);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеВидаИКонтрагента(Отказ)
	
	Контрагент = Неопределено;
	ДополнительныеСвойства.Свойство("Контрагент", Контрагент);
	
	Если Вид = Перечисления.ВидыЛидов.ПовторноеОбращение Тогда
		
		Если ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты")
			Или Не ЗначениеЗаполнено(Контрагент)
			Или Не УправлениеДоступом.ЧтениеРазрешено(Контрагент) Тогда
			
			Если ЭтоНовый() Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Контрагент = Справочники.Лиды.СвязанныйКонтрагент(Ссылка);
			Если Не ЗначениеЗаполнено(Контрагент) Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Контрагент) Тогда
		ДополнительныеСвойства.Удалить("Контрагент");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СостояниеЛида) Тогда
		СостояниеЛида = ЗаполнениеОбъектовУНФ.ПолучитьСостояниеЛида();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ГруппаДоступа) Тогда
		ГруппаДоступа = Справочники.ГруппыДоступаЛидов.ГруппаДоступаПоУмолчанию();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Вид) Тогда
		Вид = Перечисления.ВидыЛидов.ПервичноеОбращение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЕслиЛидПереводитсяВКачественный()
	
	СостояниеЛида = Справочники.СостоянияЛидов.Завершен;
	ДатаЗавершенияРаботы = ТекущаяДатаСеанса();
	ПричинаНеуспешногоЗавершенияРаботы = Неопределено;
	ВариантЗавершения = Перечисления.ВариантЗавершенияРаботыСЛидом.ПереведенВПокупателя;
	
КонецПроцедуры

Процедура ЗаполнитьЕслиЛидПереводитсяВНекачественный()
	
	СостояниеЛида = Справочники.СостоянияЛидов.Завершен;
	ДатаЗавершенияРаботы = ТекущаяДатаСеанса();
	ВариантЗавершения = Перечисления.ВариантЗавершенияРаботыСЛидом.НекачественныйЛид;
	
КонецПроцедуры

Процедура ЗаполнитьВозвратЛидаВРаботу(ДанныеЗаполнения)
	
	Если Не ДанныеЗаполнения.Свойство("СостояниеЛида") Тогда
		СостояниеЛида = СостоянияЛидов.ПолучитьСостояниеЛидаПередЗавершением(
		Ссылка, Справочники.СостоянияЛидов.Завершен);
	КонецЕсли;
	
	ПричинаНеуспешногоЗавершенияРаботы = Неопределено;
	ВариантЗавершения = Неопределено;
	ДатаЗавершенияРаботы = Дата('00010101');
	ЗаметкиЗавершенияРаботы = Неопределено;
	
КонецПроцедуры

// Процедура заполняет вспомогательный реквизит "НомерТелефона"
//
Процедура ЗаполнитьНомерТелефона() Экспорт
	
	НомераТелефонов = Новый Массив;
	
	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			НомераТелефонов.Добавить(СтрокаКИ.НомерТелефона);
		КонецЕсли;
	КонецЦикла;
	
	Если ДополнительныеСвойства.Свойство("НомераТелефоновКонтактаЛида") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НомераТелефонов, ДополнительныеСвойства.НомераТелефоновКонтактаЛида);
	КонецЕсли;

	НомерТелефонаДляПоиска = СтрСоединить(НомераТелефонов, ", ");
	
КонецПроцедуры

// Процедура заполняет вспомогательный реквизит "АдресЭП"
//
Процедура ЗаполнитьАдресЭП() Экспорт
	
	АдресаЭП = Новый Массив;
	
	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			АдресаЭП.Добавить(СтрокаКИ.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Если ДополнительныеСвойства.Свойство("АдресаЭПКонтактовЛида") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(АдресаЭП, ДополнительныеСвойства.АдресаЭПКонтактовЛида);
	КонецЕсли;
	
	АдресЭПДляПоиска = СтрСоединить(АдресаЭП, ", ");
	
КонецПроцедуры

Процедура СформироватьОсновныеСведенияЛида() Экспорт
	
	Если ДополнительныеСвойства.Свойство("ПроверенныйКонтрагент") Тогда
		
		ОсновныеСведения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ДополнительныеСвойства.ПроверенныйКонтрагент, "ОсновныеСведения");
		Возврат;
		
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	
	Если Не ПустаяСтрока(Наименование) Тогда
		МассивСтрок.Добавить(Наименование);
	КонецЕсли;
	
	Если Не ПустаяСтрока(НаименованиеКомпании) Тогда
		МассивСтрок.Добавить(НаименованиеКомпании);
	КонецЕсли;
	
	КИ = КонтактнаяИнформация.Выгрузить();
	КИ.Сортировать("Вид");
	Для Каждого СтрокаКИ Из КИ Цикл
		Если ПустаяСтрока(СтрокаКИ.Представление) Тогда
			Продолжить;
		КонецЕсли;
		МассивСтрок.Добавить(СтрокаКИ.Представление);
	КонецЦикла;
	
	Если ДополнительныеСвойства.Свойство("ОсновныеСведенияКонтактныхЛиц") Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтрок, ДополнительныеСвойства.ОсновныеСведенияКонтактныхЛиц);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактыЛида.Наименование КАК Наименование,
		|	КонтактыЛида.КонтактнаяИнформация.(
		|		Представление КАК Представление,
		|		Вид КАК ВидКИ
		|	) КАК КонтактнаяИнформация
		|ИЗ
		|	Справочник.КонтактыЛидов КАК КонтактыЛида
		|ГДЕ
		|	КонтактыЛида.ПометкаУдаления = ЛОЖЬ
		|	И КонтактыЛида.Владелец = &Лид
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование,
		|	ВидКИ";
		
		Запрос.УстановитьПараметр("Лид", Ссылка);
		
		ВыборкаКЛ = Запрос.Выполнить().Выбрать();
		Пока ВыборкаКЛ.Следующий() Цикл
			
			Если МассивСтрок.Количество() > 0 Тогда
				МассивСтрок.Добавить(Символы.ПС);
			КонецЕсли;
			МассивСтрок.Добавить(ВыборкаКЛ.Наименование);
			
			ВыборкаКИ = ВыборкаКЛ.КонтактнаяИнформация.Выбрать();
			Пока ВыборкаКИ.Следующий() Цикл
				Если ПустаяСтрока(ВыборкаКИ.Представление) Тогда
					Продолжить;
				КонецЕсли;
				МассивСтрок.Добавить(ВыборкаКИ.Представление);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(Комментарий) Тогда
		МассивСтрок.Добавить(Комментарий);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ответственный) Тогда
		МассивСтрок.Добавить(Ответственный);
	КонецЕсли;
	
	ОсновныеСведения = СтрСоединить(МассивСтрок, Символы.ПС);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСКонтрагентом

Процедура ОбработатьКонтрагентаИВидПередЗаписью()
	
	Контрагент = Неопределено;
	ДополнительныеСвойства.Свойство("Контрагент", Контрагент);
	Если Не ЗначениеЗаполнено(Контрагент) Или Не УправлениеДоступом.ЧтениеРазрешено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПроверенныйКонтрагент", Контрагент);
	Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование");
	
КонецПроцедуры

Процедура ОбработатьКонтрагентаПриЗаписи()
	
	Если Вид = Перечисления.ВидыЛидов.ПервичноеОбращение Тогда
		
		Если ЗначениеЗаполнено(ВариантЗавершения) Тогда
			Возврат;
		КонецЕсли;
		
		РегистрыСведений.СвязиКонтрагентЛид.УдалитьСвязи(Ссылка);
		
		Возврат;
		
	КонецЕсли;
	
	Если Вид <> Перечисления.ВидыЛидов.ПовторноеОбращение Тогда
		Возврат;
	КонецЕсли;
	
	Контрагент = Неопределено;
	Если Не ДополнительныеСвойства.Свойство("ПроверенныйКонтрагент", Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	СвязанныйКонтрагент = Справочники.Лиды.СвязанныйКонтрагент(Ссылка);
	Если ЗначениеЗаполнено(СвязанныйКонтрагент) Тогда
		
		Если СвязанныйКонтрагент <> Контрагент Тогда
			РегистрыСведений.СвязиКонтрагентЛид.НоваяСвязь(Контрагент, Ссылка);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	РегистрыСведений.СвязиКонтрагентЛид.НоваяСвязь(Контрагент, Ссылка);
	ДобавитьКИЛидаВКонтрагента(Контрагент);
	
КонецПроцедуры

Процедура ДобавитьКИЛидаВКонтрагента(Контрагент)
	
	Если УправлениеДоступом.ИзменениеРазрешено(Контрагент) Тогда
		КонтрагентОбъект = ДобавитьОбычнуюКИЛидаВКонтрагента(Контрагент);
	КонецЕсли;
	
	Если КонтрагентОбъект = Неопределено Тогда
		ДобавитьКонтактыЛидаДляКонтрагента(Контрагент);
	Иначе
		ДобавитьКонтактыЛидаДляКонтрагента(КонтрагентОбъект);
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьОбычнуюКИЛидаВКонтрагента(Контрагент)
	
	НоваяКИКонтрагента = КИОбъектаНаОсновеДругойКИДляПереноса(
	Контрагент, КонтактнаяИнформация);
	
	Если НоваяКИКонтрагента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтрагентОбъект = ОбъектСДобавленнойКИ(Контрагент, НоваяКИКонтрагента);
	Если КонтрагентОбъект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтрагентОбъект.Записать();
	Возврат КонтрагентОбъект;
	
КонецФункции

Функция ДобавитьКонтактыЛидаДляКонтрагента(Контрагент)
	
	Если ТипЗнч(Контрагент) = Тип("СправочникОбъект.Контрагенты") Тогда
		ДанныеКонтрагента = Контрагент;
	Иначе
		ДанныеКонтрагента = Новый Структура;
		ДанныеКонтрагента.Вставить("Ссылка", Контрагент);
		ДанныеКонтрагента.Вставить(
		"ГруппаДоступа", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "ГруппаДоступа"));
	КонецЕсли;
	
	КонтактыЛида = Справочники.КонтактыЛидов.КонтактыЛида(Ссылка);
	
	ДополнительныйВыборДанных = Новый Структура;
	ДополнительныйВыборДанных.Вставить("Наименование");
	ДополнительныйВыборДанных.Вставить("КонтактнаяИнформация");
	КонтактныеЛица = Справочники.Контрагенты.СвязанныеКонтакты(ДанныеКонтрагента.Ссылка, ДополнительныйВыборДанных);
	
	Для каждого КонтактЛида Из КонтактыЛида Цикл
		
		Если Не ЗначениеЗаполнено(КонтактЛида.Наименование) Тогда
			Продолжить;
		КонецЕсли;
		
		НужноДобавитьКонтактноеЛицо = Истина;
		Для Каждого КонтактноеЛицо Из КонтактныеЛица Цикл
			
			Если КонтактноеЛицо.Наименование <> КонтактЛида.Наименование Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяКИКонтакта = КИОбъектаНаОсновеДругойКИДляПереноса(
			КонтактноеЛицо.Ссылка,
			КонтактЛида.КонтактнаяИнформация,
			КонтактноеЛицо.КонтактнаяИнформация);
			
			Если НоваяКИКонтакта <> Неопределено Тогда
				
				КонтактОбъект = ОбъектСДобавленнойКИ(КонтактноеЛицо.Ссылка, НоваяКИКонтакта);
				Если КонтактОбъект <> Неопределено Тогда
					КонтактОбъект.Записать();
				КонецЕсли;
				
			КонецЕсли;
			
			НужноДобавитьКонтактноеЛицо = Ложь;
			Прервать;
			
		КонецЦикла;
		
		Если Не НужноДобавитьКонтактноеЛицо Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйКонтакт = Справочники.КонтактныеЛица.СоздатьЭлемент();
		НовыйКонтакт.Наименование = КонтактЛида.Наименование;
		НовыйКонтакт.Заполнить(Неопределено);
		НовыйКонтакт.ГруппаДоступа = ДанныеКонтрагента.ГруппаДоступа;
		
		ПеренестиКИВНовыйОбъект(
		НовыйКонтакт, НовыйКонтакт.Ссылка, КонтактЛида.КонтактнаяИнформация);
		НовыйКонтакт.Записать();
		
		РегистрыСведений.СвязиКонтрагентКонтакт.НоваяСвязь(ДанныеКонтрагента.Ссылка, НовыйКонтакт.Ссылка);
		
	КонецЦикла;
	
КонецФункции

Функция КИОбъектаНаОсновеДругойКИДляПереноса(
	Ссылка, КонтактнаяИнформацияИсточника, КонтактнаяИнформацияОбъекта = Неопределено)
	
	Если ТипЗнч(КонтактнаяИнформацияОбъекта) = Тип("ТаблицаЗначений") Тогда
		КИОбъекта = КонтактнаяИнформацияОбъекта;
	Иначе
		КИОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Ссылка, , ТекущаяДатаСеанса(), Ложь);
	КонецЕсли;
	
	ТаблицаНовойКИ = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
	ТипОбъекта = ТипЗнч(Ссылка);
	
	Для Каждого СтрокаКИ Из КонтактнаяИнформацияИсточника Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаКИ.Значение) И Не ЗначениеЗаполнено(СтрокаКИ.ЗначенияПолей) Тогда
			Продолжить;
		КонецЕсли;
		
		ПредставлениеКИ = СтрокаКИ.Представление;
		
		НужноДобавитьКИ = Истина;
		Для Каждого СтрокаКИОбъекта Из КИОбъекта Цикл
			
			Если СтрокаКИ.Тип <> СтрокаКИОбъекта.Тип Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаКИОбъекта.Значение)
				И Не ЗначениеЗаполнено(СтрокаКИОбъекта.ЗначенияПолей) Тогда
				Продолжить;
			КонецЕсли;
			
			ПредставлениеКИОбъекта = СтрокаКИОбъекта.Представление;
			
			Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				
				ПредставлениеКИТелефона =
				УправлениеКонтактнойИнформациейУНФКлиентСервер.НомерТелефонаВМеждународномФормате(ПредставлениеКИ);
				Если ПустаяСтрока(ПредставлениеКИТелефона) Тогда
					
					Если ПредставлениеКИОбъекта = ПредставлениеКИ Тогда
						НужноДобавитьКИ = Ложь;
					КонецЕсли;
					
					Прервать;
					
				КонецЕсли;
				
				ПредставлениеКИ = ПредставлениеКИТелефона;
				ПредставлениеКИОбъекта =
				УправлениеКонтактнойИнформациейУНФКлиентСервер.НомерТелефонаВМеждународномФормате(ПредставлениеКИОбъекта);
				
			КонецЕсли;
			
			Если ПредставлениеКИОбъекта = ПредставлениеКИ Тогда
				НужноДобавитьКИ = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не НужноДобавитьКИ Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяКИ = ТаблицаНовойКИ.Добавить();
		НоваяКИ.Вид = ВидКИПоТипуОбъекта(ТипОбъекта, СтрокаКИ.Тип, СтрокаКИ.Вид);
		ЗаполнитьЗначенияСвойств(НоваяКИ, СтрокаКИ, "Представление,ЗначенияПолей,Значение,Тип");
		
	КонецЦикла;
	
	Если Не ТаблицаНовойКИ.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТаблицаНовойКИ;
	
КонецФункции

Функция ОбъектСДобавленнойКИ(СсылкаИлиОбъект, КонтактнаяИнформация)
	
	ПолученаСсылка = ОбщегоНазначения.ЭтоСсылка(ТипЗнч(СсылкаИлиОбъект));
	Если ПолученаСсылка Тогда
		Объект = СсылкаИлиОбъект.ПолучитьОбъект();
	Иначе
		Объект = СсылкаИлиОбъект;
	КонецЕсли;
	
	Попытка
		Объект.Заблокировать();
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось заблокировать объект %1
		|
		|Описание ошибки:
		|%2'"),
		Объект,
		ТекстОшибки);
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Блокировки.Ошибка'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, Объект.Метаданные(), ,
		ТекстОшибки);
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(
	Объект, КонтактнаяИнформация, Ложь);
	
	Возврат Объект;
	
КонецФункции

Процедура ПеренестиКИВНовыйОбъект(Приемник, Ссылка, КонтактнаяИнформация)
	
	ТаблицаНовойКИ = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
	ТипОбъекта = ТипЗнч(Ссылка);
	
	Для каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаКИ.Значение) И Не ЗначениеЗаполнено(СтрокаКИ.ЗначенияПолей) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяКИ = ТаблицаНовойКИ.Добавить();
		НоваяКИ.Вид = ВидКИПоТипуОбъекта(ТипОбъекта, СтрокаКИ.Тип, СтрокаКИ.Вид);
		ЗаполнитьЗначенияСвойств(НоваяКИ, СтрокаКИ, "Представление,ЗначенияПолей,Значение,Тип");
		
	КонецЦикла;
	
	УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(Приемник, ТаблицаНовойКИ);
	
КонецПроцедуры

Функция ВидКИПоТипуОбъекта(ТипСсылки, ТипКИ, ВидКИ = Неопределено)
	
	Если ТипСсылки = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат Справочники.Лиды.ВидКИКонтрагента(ТипКИ, ВидКИ);
	КонецЕсли;
	
	Если ТипСсылки = Тип("СправочникСсылка.КонтактныеЛица") Тогда
		Возврат Справочники.Лиды.ВидКИКонтактногоЛица(ТипКИ);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

Процедура ДобавитьЗаписиВКанбанПриЗаписи()
	
	Если ЗначениеЗаполнено(ВариантЗавершения) Тогда
		
		Если ДополнительныеСвойства.ВариантЗавершенияПередЗаписью <> ВариантЗавершения Тогда
			РегистрыСведений.КанбанЛидов.ДобавитьЗавершенныйЛид(Ссылка, ВариантЗавершения);
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительныеСвойства.ВариантЗавершенияПередЗаписью) Тогда
		
		Если ДополнительныеСвойства.Свойство("КанбанЛидов") Тогда
			Порядок = ДополнительныеСвойства.КанбанЛидов.Порядок;
		КонецЕсли;
		
		РегистрыСведений.КанбанЛидов.ПереместитьЛид(
		Справочники.СостоянияЛидов.Завершен,
		СостояниеЛида,
		Ссылка,
		Порядок,
		ДополнительныеСвойства.ВариантЗавершенияПередЗаписью);
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеЗаписыватьДанныеВРегистр") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("КанбанЛидов") Тогда
		
		РегистрыСведений.КанбанЛидов.ПереместитьЛид(
		ДополнительныеСвойства.КанбанЛидов.СостояниеЛида,
		СостояниеЛида,
		Ссылка,
		ДополнительныеСвойства.КанбанЛидов.Порядок);
		
	ИначеЕсли ДополнительныеСвойства.ЭтоНовыйЛид Тогда
		
		РегистрыСведений.КанбанЛидов.ДобавитьЛидВКонец(СостояниеЛида, Ссылка);
		
	ИначеЕсли ДополнительныеСвойства.СостояниеЛидаПередЗаписью <> СостояниеЛида Тогда
		
		РегистрыСведений.КанбанЛидов.ПереместитьЛид(
		ДополнительныеСвойства.СостояниеЛидаПередЗаписью, СостояниеЛида, Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
